lib/tasks/descuento_horas.rake

SELECT "rentals".* FROM "rentals" WHERE (start_date <= '2025-06-25' AND end_date >= '2025-06-25') ORDER BY "rentals"."id" ASC LIMIT $1  [["LIMIT", 1000]]
UPDATE "machineries" SET "horas_disponibles" = $1, "updated_at" = $2 WHERE "machineries"."id" = $3  [["horas_disponibles", 142], ["updated_at", "2025-06-25 17:05:18.568088"], ["id", 4]]
---
  task descontar_horas: :environment do
    Rental.where("start_date <= ? AND end_date >= ?", Date.today, Date.today).find_each do |rental|
      machinery = rental.machinery
      next if machinery.horas_disponibles.nil? || machinery.horas_disponibles <= 0

      maquinaria_nueva = [machinery.horas_disponibles - 8, 0].max
      machinery.update(horas_disponibles: maquinaria_nueva)