app/views/rentals/_form.html.erb

    <%= form.label :machinery_id, "Maquinaria" %>
    <%= form.collection_select :machinery_id, Machinery.all, :id, :nombre, prompt: "Seleccione una maquinaria" %>
---
SELECT "machineries".* FROM "machineries"

<script>
  document.addEventListener("DOMContentLoaded", function() {
    const startDateInput = document.querySelector("#rental_start_date");
    const endDateInput = document.querySelector("#rental_end_date");
    const machinerySelect = document.querySelector("#rental_machinery_id");
    const warningDiv = document.getElementById("rental_warning");

    // Maquinarias cargadas con sus horas disponibles (puedes insertar esto desde Rails)
    const machineryHoursMap = {
      <% Machinery.all.each do |m| %>
        "<%= m.id %>": <%= m.horas_disponibles || 0 %>,
      <% end %>
    };

    function checkRentalHours() {
      const startDate = new Date(startDateInput.value);
      const endDate = new Date(endDateInput.value);
      const machineryId = machinerySelect.value;

      if (!startDate || !endDate || !machineryId) {
        warningDiv.textContent = "";
        return;
---
SELECT "machineries".* FROM "machineries"