app/controllers/customers_controller.rb

  def index
    @customers = Customer.order(created_at: :desc)
---
SELECT "customers".* FROM "customers" ORDER BY "customers"."created_at" DESC

  def create
    @customer = Customer.new(customer_params)
    if @customer.save
---
INSERT INTO "customers" ("nombre", "rut", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["nombre", "Cliente 1"], ["rut", "123456789"], ["created_at", "2025-06-25 13:45:32.537048"], ["updated_at", "2025-06-25 13:45:32.537048"]]