app/controllers/machineries_controller.rb

  def index
    @machineries = Machinery.order(created_at: :desc)
---
SELECT "machineries".* FROM "machineries" ORDER BY "machineries"."created_at" DESC

  def show_by_qr
    @machinery = Machinery.find_by!(qr_token: params[:qr_token])
---
SELECT "machineries".* FROM "machineries" WHERE "machineries"."qr_token" = $1 LIMIT $2  [["qr_token", "[FILTERED]"], ["LIMIT", 1]]

  def create
    @machinery = Machinery.new(machinery_params)
    if @machinery.save
---
INSERT INTO "machineries" ("nombre", "formato", "horas_por_mantencion", "horas_totales", "horas_disponibles", "valor_dia", "valor_semana", "valor_mes", "qr_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

  def destroy
    @machinery.destroy
---
DELETE FROM "machineries" WHERE "machineries"."id" = $1  [["id", 3]]

  def download_qr
    machinery = Machinery.find(params[:id])
---
SELECT "machineries".* FROM "machineries" WHERE "machineries"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def set_machinery
    @machinery = Machinery.find(params[:id])
---
SELECT "machineries".* FROM "machineries" WHERE "machineries"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]