app/controllers/rentals_controller.rb

SELECT "rentals".* FROM "rentals"
---
  def index
    @rentals = Rental.includes(:machinery).all

INSERT INTO "rentals" ("machinery_id", "start_date", "end_date", "payment_method", "payment_status", "observations", "discount", "freight", "total_amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
SELECT "machineries".* FROM "machineries" WHERE "machineries"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def create
    @rental = Rental.new(rental_params)

    if @rental.save
      machinery = Machinery.find(@rental.machinery_id)

SELECT "rentals".* FROM "rentals" WHERE "rentals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_rental
    @rental = Rental.find(params[:id])