app/controllers/rentals_controller.rb

  def set_rental
    @rental = Rental.find(params[:id])
---
SELECT "rentals".* FROM "rentals" WHERE "rentals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]