app/controllers/users_controller.rb

  def index
    @offset = params[:offset].to_i || 0
    @users = User.order(created_at: :desc).offset(@offset).limit(10)
    @has_more_data = User.offset(@offset + 10).exists? # ✅ Verifica si hay más usuarios para cargar
---
SELECT "users".* FROM "users" ORDER BY "users"."created_at" DESC LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
SELECT 1 AS one FROM "users" LIMIT $1 OFFSET $2  [["LIMIT", 1], ["OFFSET", 10]]